app/controllers/movies_controller.rb

  def index
  	# @movies = Movie.all
     @movies = Movie.search(page: params[:page], per_page: 10)
---
SELECT "movies".* FROM "movies"

  def show
    @reviews = Review.where(:movie_id => @movie.id)
    if @reviews.blank?
    @avg_rating = 0
    else
      @avg_rating =@reviews.average(:rating).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 6]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 5]]

  def create
    @movie = current_user.movies.build(movie_params)
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "length", "director", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["length", ""], ["director", ""], ["rating", ""], ["created_at", "2017-10-28 17:23:39.819933"], ["updated_at", "2017-10-28 17:23:39.819933"]]

  def update
      if @movie.update(movie_params)
---
UPDATE "movies" SET "description" = ?, "length" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "jkdghduigdfuui"], ["length", ""], ["director", "jkjkbdjksdb bsd"], ["updated_at", "2017-10-28 17:58:59.781138"], ["id", 1]]

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (4, 9, 11, 16, 23, 28, 5, 12, 17, 24)