app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 0], ["comment", "move 5 is best"], ["created_at", "2017-10-29 14:11:38.629098"], ["updated_at", "2017-10-29 14:11:38.629098"], ["user_id", 3], ["movie_id", 5]]
---
  def create
  	binding.pry
  	@review = Review.new(review_params)
  	@review.user_id = current_user.id
  	@review.movie_id = @movie.id
    # @review = current_user.reviews.build(review_params)
      if @review.save

UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "jhfjhsdg"], ["updated_at", "2017-10-29 11:50:29.862507"], ["id", 3]]
---
  def update
      if @review.update(review_params)